#Итоговая проверочная работа.
#
#Данная работа необходима для проверки ваших знаний и навыков по итогу первого блока обучения по прогамме разработчик. Мы должны убедиться что базовое знакомство с it прошло успешно.
#
#Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо: 
#    
#    1. Создать репозиторий на GitHib
#    2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод)
#    3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
#    4. Написать программу, решающую поставленную задачу
#    5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так что все залито одним коммитом, как минимум этампы 2, 3 и 4 должны бать расположены в разных коммитах)
#
#Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
#
#Примеры:
#
#["hello", "2", "world", ";-)"] -> ["2", ";-)"]
#
#["1234", "1567", "-2", "computer science"] -> ["-2"]
#
#["Russia", "Denmark", "Kazan"] -> [] 

Описание решения:

1. Запрос длины массива от пользователя:

#Console.WriteLine($"Введите длину массива");

2. Объвление переменной типа int, хранящей длину массива, заданную пользователем:

#int arrLen = Convert.ToInt32(Console.ReadLine());

3. Инициализация массива типа string, хранящего начальные строки, полученные от пользователя:

#string[] stringArray = new string[arrLen];

4. Объявление переменной типа string, в которую будут передаваться строки от пользователя:

#string inputString = " ";

5. Инициализация массива типа string, в который будут записаны строки, удовлетворяющие условию задания: 

#string[] resArray = new string[stringArray.GetLength(0)];

6. Запуск цикла, записывающего строки от пользователя в массивы:

#for (int i = 0; i < stringArray.GetLength(0); i++>)

7. Запрос ввода от пользователя:

#Console.WriteLine($"Введите строку: ");

8. Инициализация, ранее объявленной переменной "inputString":

#inputString = Console.ReadLine();

9. Запись, введенных пользователем строк в начальный массив:

#stringArray[i] = inputString;

10. Проверка длины, введенной пользователем строки, на соответствие условию задания:

#if (inputString <= 3)

11. Если условие выполняется, то записываем введенную строку в массив с итоговым результатом:

#resArrray[i] = inputString;

12. Вывод результата работы программы в консоль:

#Console.WriteLine($"Начальный массив: {string.Join(", ", stringArray)}");
#Console.WriteLine($"Конечный массив: {string.Join(", ", resArray)}");